Workspace/OpenFOAM-v1812-AD/tutorials/compressible/rhoCentralFoam/LadenburgJet60psi/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   nonuniform List<scalar>
1200
(
246.500760171405
243.943621693656
240.0923760553
235.073295336536
229.088081311153
222.334752595821
215.077830471114
207.475928020599
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 247.1;
    }
    outlet
    {
        type            zeroGradient;
    }
    freestreamInlet
    {
        type            fixedValue;
        value           uniform 297;
    }
    freestream
    {
        type            totalTemperature;
        psi             thermo:psi;
        gamma           1.4;
        T0              uniform 297;
        value           nonuniform List<scalar>
60
(
296.557959148953
296.525967135668
296.52866728063
296.525274100592
296.518583566195
296.514128301684
296.518515914383
296.519823467752
...
)
;
    }
    wedge1
    {
        type            wedge;
    }
    wedge2
    {
        type            wedge;
    }
    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
