Workspace/OpenFOAM-v1812-AD/tutorials/compressible/rhoCentralFoam/LadenburgJet60psi/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar>
1200
(
269426.444889126
259785.896566678
245735.035412628
228247.511852751
208574.441521737
187858.599021482
167277.674826677
147491.038197839
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 271724;
    }
    outlet
    {
        type            waveTransmissive;
        field           p;
        psi             thermo:psi;
        gamma           1.4;
        fieldInf        101325;
        lInf            0.025;
        value           nonuniform List<scalar>
20
(
36562.2300054432
37796.3395360008
38604.5885832062
40282.1012142189
43735.7987076211
50011.3827879648
59398.8682675419
68240.1422235396
76860.7301618588
83575.1015338783
90186.4734188025
93586.7407655955
98259.2964252222
99393.6110290325
101021.715576502
101089.698393948
101353.834392321
101333.992212855
101507.234628921
101271.59983682
)
;
    }
    freestreamInlet
    {
        type            zeroGradient;
    }
    freestream
    {
        type            totalPressure;
        rho             none;
        psi             thermo:psi;
        gamma           1.4;
        p0              uniform 101325;
        value           nonuniform List<scalar>
60
(
100798.155459262
100760.102007904
100763.313345283
100759.277778931
100751.320951579
100746.022704402
100751.240497807
100752.795490829
...
)
;
    }
    wedge1
    {
        type            wedge;
    }
    wedge2
    {
        type            wedge;
    }
    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
